xhawk18/s_task/build/stm32f302/Libraries/STM32F30x_I2C_CPAL_Driver/src/stm32f30x_i2c_cpal_hal.c
/**
  *********************************************************************************
  * @file    stm32f30x_i2c_cpal_hal.c
  * @author  MCD Application Team
  * @version V1.2.1
  * @date    31-October-2014
  * @brief   This file provides all the CPAL_I2C_HAL (hardware Abstraction Layer)
  *          firmware functions.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2014 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software
  * distributed under the License is distributed on an "AS IS" BASIS,
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32f30x_i2c_cpal_hal.h"

/* Private typedef -----------------------------------------------------------*/
/* Private defines -----------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/


/* Private variables ---------------------------------------------------------*/

/*========= Local Structures declaration =========*/

CPAL_InitTypeDef* I2C_DevStructures[CPAL_I2C_DEV_NUM] =
{
#ifdef CPAL_I2C1_SUPPORTED
  #ifdef CPAL_USE_I2C1
    &I2C1_DevStructure,
  #else
    pNULL,
  #endif
#endif /* CPAL_I2C1_SUPPORTED */

#ifdef CPAL_I2C2_SUPPORTED
  #ifdef CPAL_USE_I2C2
    &I2C2_DevStructure,
  #else
    pNULL,
  #endif
#endif /* CPAL_I2C2_SUPPORTED */

#ifdef CPAL_I2C3_SUPPORTED
  #ifdef CPAL_USE_I2C3
    &I2C3_DevStructure,
  #else
    pNULL,
  #endif
#endif /* CPAL_I2C3_SUPPORTED */
};

#ifdef CPAL_I2C1_SUPPORTED
  #ifdef CPAL_USE_I2C1
  CPAL_InitTypeDef I2C1_DevStructure = {  CPAL_I2C1,                          /* I2C1 device number */
                                          CPAL_DIRECTION_TXRX,                /* Transmitter and Receiver direction selected */
                                          CPAL_MODE_MASTER,                   /* Mode Master selected */
                                          #ifdef CPAL_I2C_DMA_PROGMODEL
                                          CPAL_PROGMODEL_DMA,                 /* DMA Programming Model selected */
                                          #else
                                          CPAL_PROGMODEL_INTERRUPT,           /* IT Programming Model selected */
                                          #endif /* CPAL_I2C_DMA_PROGMODEL */
                                          (CPAL_TransferTypeDef*) pNULL,       /* Point pCPAL_TransferTx to a Null pointer */
                                          (CPAL_TransferTypeDef*) pNULL,       /* Point pCPAL_TransferRx to a Null pointer */
                                          CPAL_STATE_DISABLED,                 /* Device Disabled */
                                          CPAL_I2C_ERR_NONE,                   /* No Device Error */
                                          ((uint32_t)0x00000000),              /* No Options selected */
                                          ((uint32_t)CPAL_I2C_TIMEOUT_DEFAULT),/* Set timeout value to CPAL_I2C_TIMEOUT_DEFAULT */
                                          (I2C_InitTypeDef*) pNULL};           /* Point pCPAL_I2C_Struct to a Null pointer */

  #endif /* CPAL_USE_I2C1 */
#endif /* CPAL_I2C1_SUPPORTED */

#ifdef CPAL_I2C2_SUPPORTED
  #ifdef CPAL_USE_I2C2
  CPAL_InitTypeDef I2C2_DevStructure = {  CPAL_I2C2,                          /* I2C2 device number */
                                          CPAL_DIRECTION_TXRX,                /* Transmitter and Receiver direction selected */
                                          CPAL_MODE_MASTER,                   /* Mode Master selected */
                                          #ifdef CPAL_I2C_DMA_PROGMODEL
                                          CPAL_PROGMODEL_DMA,                 /* DMA Programming Model selected */
                                          #else
                                          CPAL_PROGMODEL_INTERRUPT,           /* IT Programming Model selected */
                                          #endif /* CPAL_I2C_DMA_PROGMODEL */
                                          (CPAL_TransferTypeDef*) pNULL,       /* Point pCPAL_TransferTx to a Null pointer */
                                          (CPAL_TransferTypeDef*) pNULL,       /* Point pCPAL_TransferRx to a Null pointer */
                                          CPAL_STATE_DISABLED,                 /* Device Disabled */
                                          CPAL_I2C_ERR_NONE,                   /* No Device Error */
                                          ((uint32_t)0x00000000),              /* No Options selected */
                                          ((uint32_t)CPAL_I2C_TIMEOUT_DEFAULT),/* Set timeout value to CPAL_I2C_TIMEOUT_DEFAULT */
                                          (I2C_InitTypeDef*) pNULL};           /* Point pCPAL_I2C_Struct to a Null pointer */
  #endif /* CPAL_USE_I2C2 */
#endif /* CPAL_I2C2_SUPPORTED */

#ifdef CPAL_I2C3_SUPPORTED
  #ifdef CPAL_USE_I2C3
  CPAL_InitTypeDef I2C3_DevStructure = {  CPAL_I2C3,                          /* I2C3 device number */
                                          CPAL_DIRECTION_TXRX,                /* Transmitter and Receiver direction selected */
                                          CPAL_MODE_MASTER,                   /* Mode Master selected */
                                          #ifdef CPAL_I2C_DMA_PROGMODEL
                                          CPAL_PROGMODEL_DMA,                 /* DMA Programming Model selected */
                                          #else
                                          CPAL_PROGMODEL_INTERRUPT,           /* IT Programming Model selected */
                                          #endif /* CPAL_I2C_DMA_PROGMODEL */
                                          (CPAL_TransferTypeDef*) pNULL,       /* Point pCPAL_TransferTx to a Null pointer */
                                          (CPAL_TransferTypeDef*) pNULL,       /* Point pCPAL_TransferRx to a Null pointer */
                                          CPAL_STATE_DISABLED,                 /* Device Disabled */
                                          CPAL_I2C_ERR_NONE,                   /* No Device Error */
                                          ((uint32_t)0x00000000),              /* No Options selected */
                                          ((uint32_t)CPAL_I2C_TIMEOUT_DEFAULT),/* Set timeout value to CPAL_I2C_TIMEOUT_DEFAULT */
                                          (I2C_InitTypeDef*) pNULL};           /* Point pCPAL_I2C_Struct to a Null pointer */
  #endif /* CPAL_USE_I2C3 */
#endif /* CPAL_I2C3_SUPPORTED */

DMA_InitTypeDef CPAL_DMA_InitStructure;

