xhawk18/s_task/build/stm32f302/Libraries/STM32F30x_I2C_CPAL_Driver/src/stm32f30x_i2c_cpal_hal.c
#if defined (CPAL_I2C1_SUPPORTED) && defined (CPAL_I2C2_SUPPORTED) && defined (CPAL_I2C3_SUPPORTED)

I2C_TypeDef* CPAL_I2C_DEVICE[3] = {I2C1,I2C2,I2C3};

const uint32_t CPAL_I2C_CLK[3] = {CPAL_I2C1_CLK,CPAL_I2C2_CLK,CPAL_I2C3_CLK};
const uint32_t CPAL_I2C_TXDR[3] = {CPAL_I2C1_TXDR,CPAL_I2C2_TXDR,CPAL_I2C3_TXDR};
const uint32_t CPAL_I2C_RXDR[3] = {CPAL_I2C1_RXDR,CPAL_I2C2_RXDR,CPAL_I2C3_RXDR};

const GPIO_TypeDef* CPAL_I2C_SCL_GPIO_PORT[3] = {CPAL_I2C1_SCL_GPIO_PORT,CPAL_I2C2_SCL_GPIO_PORT,CPAL_I2C3_SCL_GPIO_PORT};
const uint16_t CPAL_I2C_SCL_GPIO_PIN[3] = {CPAL_I2C1_SCL_GPIO_PIN,CPAL_I2C2_SCL_GPIO_PIN,CPAL_I2C3_SCL_GPIO_PIN};
const uint32_t CPAL_I2C_SCL_GPIO_CLK[3] = {CPAL_I2C1_SCL_GPIO_CLK,CPAL_I2C2_SCL_GPIO_CLK,CPAL_I2C3_SCL_GPIO_CLK};
const uint16_t CPAL_I2C_SCL_GPIO_PINSOURCE[3] = {CPAL_I2C1_SCL_GPIO_PINSOURCE,CPAL_I2C2_SCL_GPIO_PINSOURCE,CPAL_I2C3_SCL_GPIO_PINSOURCE};
const uint16_t CPAL_I2C_SCL_GPIO_AF[3] = {CPAL_I2C1_SCL_GPIO_AF,CPAL_I2C2_SCL_GPIO_AF,CPAL_I2C3_SCL_GPIO_AF};

const GPIO_TypeDef* CPAL_I2C_SDA_GPIO_PORT[3] = {CPAL_I2C1_SDA_GPIO_PORT,CPAL_I2C2_SDA_GPIO_PORT,CPAL_I2C3_SDA_GPIO_PORT};
const uint16_t CPAL_I2C_SDA_GPIO_PIN[3] = {CPAL_I2C1_SDA_GPIO_PIN,CPAL_I2C2_SDA_GPIO_PIN,CPAL_I2C3_SDA_GPIO_PIN};
const uint32_t CPAL_I2C_SDA_GPIO_CLK[3] = {CPAL_I2C1_SDA_GPIO_CLK,CPAL_I2C2_SDA_GPIO_CLK,CPAL_I2C3_SDA_GPIO_CLK};
const uint16_t CPAL_I2C_SDA_GPIO_PINSOURCE[3] = {CPAL_I2C1_SDA_GPIO_PINSOURCE,CPAL_I2C2_SDA_GPIO_PINSOURCE,CPAL_I2C3_SDA_GPIO_PINSOURCE};
const uint16_t CPAL_I2C_SDA_GPIO_AF[3] = {CPAL_I2C1_SDA_GPIO_AF,CPAL_I2C2_SDA_GPIO_AF,CPAL_I2C3_SDA_GPIO_AF};

const uint32_t CPAL_I2C_DMA_CLK[3] = {CPAL_I2C1_DMA_CLK,CPAL_I2C2_DMA_CLK,CPAL_I2C3_DMA_CLK};

DMA_Channel_TypeDef* CPAL_I2C_DMA_TX_Channel[3] = {CPAL_I2C1_DMA_TX_Channel,CPAL_I2C2_DMA_TX_Channel,CPAL_I2C3_DMA_TX_Channel};
DMA_Channel_TypeDef* CPAL_I2C_DMA_RX_Channel[3] = {CPAL_I2C1_DMA_RX_Channel,CPAL_I2C2_DMA_RX_Channel,CPAL_I2C3_DMA_RX_Channel};

const IRQn_Type CPAL_I2C_DMA_TX_IRQn[3] = {CPAL_I2C1_DMA_TX_IRQn,CPAL_I2C2_DMA_TX_IRQn,CPAL_I2C3_DMA_TX_IRQn};
const IRQn_Type CPAL_I2C_DMA_RX_IRQn[3] = {CPAL_I2C1_DMA_RX_IRQn,CPAL_I2C2_DMA_RX_IRQn,CPAL_I2C3_DMA_RX_IRQn};

const IRQn_Type CPAL_I2C_IT_EVT_IRQn[3] = {CPAL_I2C1_IT_EVT_IRQn,CPAL_I2C2_IT_EVT_IRQn,CPAL_I2C3_IT_EVT_IRQn};
const IRQn_Type CPAL_I2C_IT_ERR_IRQn[3] = {CPAL_I2C1_IT_ERR_IRQn,CPAL_I2C2_IT_ERR_IRQn,CPAL_I2C3_IT_ERR_IRQn};

const uint8_t I2C_IT_EVT_PREPRIO[3] = {I2C1_IT_EVT_PREPRIO,I2C2_IT_EVT_PREPRIO,I2C3_IT_EVT_PREPRIO};
const uint8_t I2C_IT_EVT_SUBPRIO[3] = {I2C1_IT_EVT_SUBPRIO,I2C2_IT_EVT_SUBPRIO,I2C3_IT_EVT_SUBPRIO};

const uint8_t I2C_IT_ERR_PREPRIO[3] = {I2C1_IT_ERR_PREPRIO,I2C2_IT_ERR_PREPRIO,I2C3_IT_ERR_PREPRIO};
const uint8_t I2C_IT_ERR_SUBPRIO[3] = {I2C1_IT_ERR_SUBPRIO,I2C2_IT_ERR_SUBPRIO,I2C3_IT_ERR_SUBPRIO};

const uint8_t I2C_IT_DMATX_PREPRIO[3] = {I2C1_IT_DMATX_PREPRIO,I2C2_IT_DMATX_PREPRIO,I2C3_IT_DMATX_PREPRIO};
const uint8_t I2C_IT_DMATX_SUBPRIO[3] = {I2C1_IT_DMATX_SUBPRIO,I2C2_IT_DMATX_SUBPRIO,I2C3_IT_DMATX_SUBPRIO};

const uint8_t I2C_IT_DMARX_PREPRIO[3] = {I2C1_IT_DMARX_PREPRIO,I2C2_IT_DMARX_PREPRIO,I2C3_IT_DMARX_PREPRIO};
const uint8_t I2C_IT_DMARX_SUBPRIO[3] = {I2C1_IT_DMARX_SUBPRIO,I2C2_IT_DMARX_SUBPRIO,I2C3_IT_DMARX_SUBPRIO};

DMA_TypeDef* CPAL_I2C_DMA[3] = {CPAL_I2C1_DMA,CPAL_I2C2_DMA,CPAL_I2C3_DMA};

const uint32_t CPAL_I2C_DMA_TX_TC_FLAG[3] = {CPAL_I2C1_DMA_TX_TC_FLAG,CPAL_I2C2_DMA_TX_TC_FLAG,CPAL_I2C3_DMA_TX_TC_FLAG};
const uint32_t CPAL_I2C_DMA_TX_HT_FLAG[3] = {CPAL_I2C1_DMA_TX_HT_FLAG,CPAL_I2C2_DMA_TX_HT_FLAG,CPAL_I2C3_DMA_TX_HT_FLAG};
const uint32_t CPAL_I2C_DMA_TX_TE_FLAG[3] = {CPAL_I2C1_DMA_TX_TE_FLAG,CPAL_I2C3_DMA_TX_TE_FLAG,CPAL_I2C3_DMA_TX_TE_FLAG};

const uint32_t CPAL_I2C_DMA_RX_TC_FLAG[3] = {CPAL_I2C1_DMA_RX_TC_FLAG,CPAL_I2C2_DMA_RX_TC_FLAG,CPAL_I2C3_DMA_RX_TC_FLAG};
const uint32_t CPAL_I2C_DMA_RX_HT_FLAG[3] = {CPAL_I2C1_DMA_RX_HT_FLAG,CPAL_I2C2_DMA_RX_HT_FLAG,CPAL_I2C3_DMA_RX_HT_FLAG};
const uint32_t CPAL_I2C_DMA_RX_TE_FLAG[3] = {CPAL_I2C1_DMA_RX_TE_FLAG,CPAL_I2C2_DMA_RX_TE_FLAG,CPAL_I2C3_DMA_RX_TE_FLAG};

#elif defined (CPAL_I2C1_SUPPORTED) && defined (CPAL_I2C2_SUPPORTED)

I2C_TypeDef* CPAL_I2C_DEVICE[2] = {I2C1,I2C2};

const uint32_t CPAL_I2C_CLK[2] = {CPAL_I2C1_CLK,CPAL_I2C2_CLK};
const uint32_t CPAL_I2C_TXDR[2] = {CPAL_I2C1_TXDR,CPAL_I2C2_TXDR};
const uint32_t CPAL_I2C_RXDR[2] = {CPAL_I2C1_RXDR,CPAL_I2C2_RXDR};

const GPIO_TypeDef* CPAL_I2C_SCL_GPIO_PORT[2] = {CPAL_I2C1_SCL_GPIO_PORT,CPAL_I2C2_SCL_GPIO_PORT};
const uint16_t CPAL_I2C_SCL_GPIO_PIN[2] = {CPAL_I2C1_SCL_GPIO_PIN,CPAL_I2C2_SCL_GPIO_PIN};
const uint32_t CPAL_I2C_SCL_GPIO_CLK[2] = {CPAL_I2C1_SCL_GPIO_CLK,CPAL_I2C2_SCL_GPIO_CLK};
const uint16_t CPAL_I2C_SCL_GPIO_PINSOURCE[2] = {CPAL_I2C1_SCL_GPIO_PINSOURCE,CPAL_I2C2_SCL_GPIO_PINSOURCE};
const uint16_t CPAL_I2C_SCL_GPIO_AF[2] = {CPAL_I2C1_SCL_GPIO_AF,CPAL_I2C2_SCL_GPIO_AF};

const GPIO_TypeDef* CPAL_I2C_SDA_GPIO_PORT[2] = {CPAL_I2C1_SDA_GPIO_PORT,CPAL_I2C2_SDA_GPIO_PORT};
const uint16_t CPAL_I2C_SDA_GPIO_PIN[2] = {CPAL_I2C1_SDA_GPIO_PIN,CPAL_I2C2_SDA_GPIO_PIN};
const uint32_t CPAL_I2C_SDA_GPIO_CLK[2] = {CPAL_I2C1_SDA_GPIO_CLK,CPAL_I2C2_SDA_GPIO_CLK};
const uint16_t CPAL_I2C_SDA_GPIO_PINSOURCE[2] = {CPAL_I2C1_SDA_GPIO_PINSOURCE,CPAL_I2C2_SDA_GPIO_PINSOURCE};
const uint16_t CPAL_I2C_SDA_GPIO_AF[2] = {CPAL_I2C1_SDA_GPIO_AF,CPAL_I2C2_SDA_GPIO_AF};

const uint32_t CPAL_I2C_DMA_CLK[2] = {CPAL_I2C1_DMA_CLK,CPAL_I2C2_DMA_CLK};

DMA_Channel_TypeDef* CPAL_I2C_DMA_TX_Channel[2] = {CPAL_I2C1_DMA_TX_Channel,CPAL_I2C2_DMA_TX_Channel};
DMA_Channel_TypeDef* CPAL_I2C_DMA_RX_Channel[2] = {CPAL_I2C1_DMA_RX_Channel,CPAL_I2C2_DMA_RX_Channel};

const IRQn_Type CPAL_I2C_DMA_TX_IRQn[2] = {CPAL_I2C1_DMA_TX_IRQn,CPAL_I2C2_DMA_TX_IRQn};
const IRQn_Type CPAL_I2C_DMA_RX_IRQn[2] = {CPAL_I2C1_DMA_RX_IRQn,CPAL_I2C2_DMA_RX_IRQn};

const IRQn_Type CPAL_I2C_IT_EVT_IRQn[2] = {CPAL_I2C1_IT_EVT_IRQn,CPAL_I2C2_IT_EVT_IRQn};
const IRQn_Type CPAL_I2C_IT_ERR_IRQn[2] = {CPAL_I2C1_IT_ERR_IRQn,CPAL_I2C2_IT_ERR_IRQn};

const uint8_t I2C_IT_EVT_PREPRIO[2] = {I2C1_IT_EVT_PREPRIO,I2C2_IT_EVT_PREPRIO};
const uint8_t I2C_IT_EVT_SUBPRIO[2] = {I2C1_IT_EVT_SUBPRIO,I2C2_IT_EVT_SUBPRIO};

