xhawk18/s_task/build/stm32f302/Libraries/STM32F30x_I2C_CPAL_Driver/src/stm32f30x_i2c_cpal_hal.c
const uint8_t I2C_IT_ERR_PREPRIO[2] = {I2C1_IT_ERR_PREPRIO,I2C2_IT_ERR_PREPRIO};
const uint8_t I2C_IT_ERR_SUBPRIO[2] = {I2C1_IT_ERR_SUBPRIO,I2C2_IT_ERR_SUBPRIO};

const uint8_t I2C_IT_DMATX_PREPRIO[2] = {I2C1_IT_DMATX_PREPRIO,I2C2_IT_DMATX_PREPRIO};
const uint8_t I2C_IT_DMATX_SUBPRIO[2] = {I2C1_IT_DMATX_SUBPRIO,I2C2_IT_DMATX_SUBPRIO};

const uint8_t I2C_IT_DMARX_PREPRIO[2] = {I2C1_IT_DMARX_PREPRIO,I2C2_IT_DMARX_PREPRIO};
const uint8_t I2C_IT_DMARX_SUBPRIO[2] = {I2C1_IT_DMARX_SUBPRIO,I2C2_IT_DMARX_SUBPRIO};

DMA_TypeDef* CPAL_I2C_DMA[2] = {CPAL_I2C1_DMA,CPAL_I2C2_DMA};

const uint32_t CPAL_I2C_DMA_TX_TC_FLAG[2] = {CPAL_I2C1_DMA_TX_TC_FLAG,CPAL_I2C2_DMA_TX_TC_FLAG};
const uint32_t CPAL_I2C_DMA_TX_HT_FLAG[2] = {CPAL_I2C1_DMA_TX_HT_FLAG,CPAL_I2C2_DMA_TX_HT_FLAG};
const uint32_t CPAL_I2C_DMA_TX_TE_FLAG[2] = {CPAL_I2C1_DMA_TX_TE_FLAG,CPAL_I2C2_DMA_TX_TE_FLAG};

const uint32_t CPAL_I2C_DMA_RX_TC_FLAG[2] = {CPAL_I2C1_DMA_RX_TC_FLAG,CPAL_I2C2_DMA_RX_TC_FLAG};
const uint32_t CPAL_I2C_DMA_RX_HT_FLAG[2] = {CPAL_I2C1_DMA_RX_HT_FLAG,CPAL_I2C2_DMA_RX_HT_FLAG};
const uint32_t CPAL_I2C_DMA_RX_TE_FLAG[2] = {CPAL_I2C1_DMA_RX_TE_FLAG,CPAL_I2C2_DMA_RX_TE_FLAG};

#else

I2C_TypeDef* CPAL_I2C_DEVICE[1] = {I2C1};

const uint32_t CPAL_I2C_CLK[1] = {CPAL_I2C1_CLK};
const uint32_t CPAL_I2C_TXDR[1] = {CPAL_I2C1_TXDR};
const uint32_t CPAL_I2C_RXDR[1] = {CPAL_I2C1_RXDR};

const GPIO_TypeDef* CPAL_I2C_SCL_GPIO_PORT[1] = {CPAL_I2C1_SCL_GPIO_PORT};
const uint16_t CPAL_I2C_SCL_GPIO_PIN[1] = {CPAL_I2C1_SCL_GPIO_PIN};
const uint32_t CPAL_I2C_SCL_GPIO_CLK[1] = {CPAL_I2C1_SCL_GPIO_CLK};
const uint16_t CPAL_I2C_SCL_GPIO_PINSOURCE[1] = {CPAL_I2C1_SCL_GPIO_PINSOURCE};
const uint16_t CPAL_I2C_SCL_GPIO_AF[1] = {CPAL_I2C1_SCL_GPIO_AF};

const GPIO_TypeDef* CPAL_I2C_SDA_GPIO_PORT[1] = {CPAL_I2C1_SDA_GPIO_PORT};
const uint16_t CPAL_I2C_SDA_GPIO_PIN[1] = {CPAL_I2C1_SDA_GPIO_PIN};
const uint32_t CPAL_I2C_SDA_GPIO_CLK[1] = {CPAL_I2C1_SDA_GPIO_CLK};
const uint16_t CPAL_I2C_SDA_GPIO_PINSOURCE[1] = {CPAL_I2C1_SDA_GPIO_PINSOURCE};
const uint16_t CPAL_I2C_SDA_GPIO_AF[1] = {CPAL_I2C1_SDA_GPIO_AF};

const uint32_t CPAL_I2C_DMA_CLK[1] = {CPAL_I2C1_DMA_CLK};

DMA_Channel_TypeDef* CPAL_I2C_DMA_TX_Channel[1] = {CPAL_I2C1_DMA_TX_Channel};
DMA_Channel_TypeDef* CPAL_I2C_DMA_RX_Channel[1] = {CPAL_I2C1_DMA_RX_Channel};

const IRQn_Type CPAL_I2C_DMA_TX_IRQn[1] = {CPAL_I2C1_DMA_TX_IRQn};
const IRQn_Type CPAL_I2C_DMA_RX_IRQn[1] = {CPAL_I2C1_DMA_RX_IRQn};

const IRQn_Type CPAL_I2C_IT_EVT_IRQn[1] = {CPAL_I2C1_IT_EVT_IRQn};
const IRQn_Type CPAL_I2C_IT_ERR_IRQn[1] = {CPAL_I2C1_IT_ERR_IRQn};

const uint8_t I2C_IT_EVT_PREPRIO[1] = {I2C1_IT_EVT_PREPRIO};
const uint8_t I2C_IT_EVT_SUBPRIO[1] = {I2C1_IT_EVT_SUBPRIO};

const uint8_t I2C_IT_ERR_PREPRIO[1] = {I2C1_IT_ERR_PREPRIO};
const uint8_t I2C_IT_ERR_SUBPRIO[1] = {I2C1_IT_ERR_SUBPRIO};

const uint8_t I2C_IT_DMATX_PREPRIO[1] = {I2C1_IT_DMATX_PREPRIO};
const uint8_t I2C_IT_DMATX_SUBPRIO[1] = {I2C1_IT_DMATX_SUBPRIO};

const uint8_t I2C_IT_DMARX_PREPRIO[1] = {I2C1_IT_DMARX_PREPRIO};
const uint8_t I2C_IT_DMARX_SUBPRIO[1] = {I2C1_IT_DMARX_SUBPRIO};

DMA_TypeDef* CPAL_I2C_DMA[1] = {CPAL_I2C1_DMA};

const uint32_t CPAL_I2C_DMA_TX_TC_FLAG[1] = {CPAL_I2C1_DMA_TX_TC_FLAG};
const uint32_t CPAL_I2C_DMA_TX_HT_FLAG[1] = {CPAL_I2C1_DMA_TX_HT_FLAG};
const uint32_t CPAL_I2C_DMA_TX_TE_FLAG[1] = {CPAL_I2C1_DMA_TX_TE_FLAG};

const uint32_t CPAL_I2C_DMA_RX_TC_FLAG[1] = {CPAL_I2C1_DMA_RX_TC_FLAG};
const uint32_t CPAL_I2C_DMA_RX_HT_FLAG[1] = {CPAL_I2C1_DMA_RX_HT_FLAG};
const uint32_t CPAL_I2C_DMA_RX_TE_FLAG[1] = {CPAL_I2C1_DMA_RX_TE_FLAG};
#endif /* CPAL_I2C1_SUPPORTED && CPAL_I2C2_SUPPORTED && CPAL_I2C3_SUPPORTED */

/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/

/*================== CPAL_I2C_HAL_Config ==================*/

/**
  * @brief  Configure NVIC Priority Group.
  * @param  None.
  * @retval None.
  */
void CPAL_HAL_NVICInit(void)
{
 /* Set NVIC Group Priority */
  NVIC_PriorityGroupConfig (CPAL_NVIC_PRIOGROUP);
}

/**
  * @brief  Reset then enable the I2C device clock.
  * @param  Device : I2C Device instance.
  * @retval None
  */
void CPAL_I2C_HAL_CLKInit(CPAL_DevTypeDef Device)
{
  /* Reset I2Cx device clock in order to avoid non-cleared error flags */
  __I2C_RCC_RESET(CPAL_I2C_CLK [Device]);

  /* Enable I2Cx device clock */
  __I2C_CLK_CMD(CPAL_I2C_CLK [Device], ENABLE);
}


/**
  * @brief  Reset then disable the I2C device clock.
  * @param  Device : I2C Device instance
  * @retval None.
  */
void CPAL_I2C_HAL_CLKDeInit(CPAL_DevTypeDef Device)
{
  /* Reset I2Cx device clock in order to avoid non-cleared error flags */
  __I2C_RCC_RESET(CPAL_I2C_CLK[Device]);

  /* Disable I2Cx device clock */
  __I2C_CLK_CMD(CPAL_I2C_CLK[Device], DISABLE);
}


/**
  * @brief  Configure the IO pins used by the I2C device.
  * @param  Device : I2C Device instance.
  * @retval None.
  */
void CPAL_I2C_HAL_GPIOInit(CPAL_DevTypeDef Device)
{
  GPIO_InitTypeDef GPIO_InitStructure;

  /* Enable I2Cx SCL and SDA Pin Clock */
  __I2C_GPIO_CLK_CMD((CPAL_I2C_SCL_GPIO_CLK[Device] | CPAL_I2C_SDA_GPIO_CLK[Device]), ENABLE);

  /* Connect PXx to I2C_SCL */
  GPIO_PinAFConfig((GPIO_TypeDef*)CPAL_I2C_SCL_GPIO_PORT[Device],CPAL_I2C_SCL_GPIO_PINSOURCE[Device],CPAL_I2C_SCL_GPIO_AF[Device]);

  /* Connect PXx to I2C_SDA */
  GPIO_PinAFConfig((GPIO_TypeDef*)CPAL_I2C_SDA_GPIO_PORT[Device],CPAL_I2C_SDA_GPIO_PINSOURCE[Device],CPAL_I2C_SDA_GPIO_AF[Device]);

  /* Set GPIO frequency to 50MHz */
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;

  /* Select Alternate function mode */
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;

  /* Select output Open Drain type */
  GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;

  /* Disable internal Pull-up */
  GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_NOPULL;

  /* Initialize I2Cx SCL Pin */
  GPIO_InitStructure.GPIO_Pin = CPAL_I2C_SCL_GPIO_PIN[Device];
  GPIO_Init((GPIO_TypeDef*)CPAL_I2C_SCL_GPIO_PORT[Device], &GPIO_InitStructure);

  /* Initialize I2Cx SDA Pin */
  GPIO_InitStructure.GPIO_Pin = CPAL_I2C_SDA_GPIO_PIN[Device];
  GPIO_Init((GPIO_TypeDef*)CPAL_I2C_SDA_GPIO_PORT[Device], &GPIO_InitStructure);
}


/**
  * @brief  Deinitialize the IO pins used by the I2C device
  *         (configured to their default state).
  * @param  Device : I2C Device instance.
  * @retval None.
  */
void CPAL_I2C_HAL_GPIODeInit(CPAL_DevTypeDef Device)
{
  GPIO_InitTypeDef GPIO_InitStructure;

  /* Set GPIO frequency to 50MHz */
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;

  /* Select Input floating mode */
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;

