xhawk18/s_task/build/stm32f302/Libraries/STM32F30x_I2C_CPAL_Driver/src/stm32f30x_i2c_cpal_hal.c
/*================== CPAL_I2C3_IRQhandler ==================*/
#ifdef CPAL_I2C3_SUPPORTED
  #ifdef CPAL_USE_I2C3

/**
  * @brief  This function handles I2C3 interrupt request.
  * @param  None.
  * @retval CPAL_PASS.
  */
uint32_t I2C3_EV_IRQHandler(void)
{
  /* Call the Common Event handler function */
  return CPAL_I2C_EV_IRQHandler(&I2C3_DevStructure);
}


/**
  * @brief  This function handles I2C3 Errors interrupt.
  * @param  None.
  * @retval CPAL_PASS.
  */
uint32_t I2C3_ER_IRQHandler(void)
{
  CPAL_LOG("\n\r\n\rLOG <I2C3_ER_IRQHandler> : I2C3 Device Error IT ");

  /* Call the Common Error handler function */
  CPAL_I2C_ER_IRQHandler(&I2C3_DevStructure);

  return CPAL_PASS;
}


 #ifdef CPAL_I2C_DMA_PROGMODEL
/**
  * @brief  This function handles I2C3 TX DMA interrupt request.
  * @param  None.
  * @retval CPAL_PASS.
  */
uint32_t CPAL_I2C3_DMA_TX_IRQHandler(void)
{
  /* Call the Common DMA TX handler function */
  return CPAL_I2C_DMA_TX_IRQHandler(&I2C3_DevStructure);
}


/**
  * @brief  This function handles I2C3 RX DMA interrupt request.
  * @param  None.
  * @retval CPAL_PASS.
  */
uint32_t CPAL_I2C3_DMA_RX_IRQHandler(void)
{
  /* Call the Common DMA RX handler function */
  return CPAL_I2C_DMA_RX_IRQHandler(&I2C3_DevStructure);
}
   #endif /* CPAL_I2C_DMA_PROGMODEL */
  #endif /* CPAL_USE_I2C3 */
#endif /* CPAL_I2C1_SUPPORTED */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
